function num_letters(k, d) {
    let i = '', e = [
        ['', 'тисяч', 'мільйон', 'мільярд', 'трильйон', 'квадрильйон', 'квінтильйон', 'секстильйон', 'септильйон', 'октильйон', 'нонильйон', 'децильйон'],
        ['а', 'і', ''],
        ['', 'и', 'ів']
    ];
    if (k == '' || k == '0') return ' нуль';
    k = k.split(/(?=(?:\d{3})+$)/);
    if (k[0].length == 1) k[0] = '00' + k[0];
    if (k[0].length == 2) k[0] = '0' + k[0];
    for (var j = (k.length - 1); j >= 0; j--) {
        if (k[j] != '000') {
            i = (((d && j == (k.length - 1)) || j == (k.length - 2)) && (k[j][2] == '1' || k[j][2] == '2') ? t(k[j], 1) : t(k[j])) + declOfNum(k[j], e[0][k.length - 1 - j], (j == (k.length - 2) ? e[1] : e[2])) + i;
        }
    }

    function t(k, d) {
        var e = [
            ['', ' один', ' два', ' три', ' чотири', ' п`ять', ' шість', ' сім', ' вісім', ' дев`ять'],
            [' десять', ' одинадцять', ' дванадцять', ' тринадцять', ' чотирнадцять', ' п`ятнадцять', ' шістнадцять', ' сімнадцять', ' вісімнадцять', ' дев`ятнадцять'],
            ['', '', ' двадцять', ' тридцять', ' сорок', ' п`ятдесят', ' шістдесят', ' сімдесят', ' вісімдесят', ' дев`яносто'],
            ['', ' сто', ' двісті', ' триста', ' чотириста', ' п`ятсот', ' шістсот', ' сімсот', ' вісімсот', ' дев`ятсот'],
            ['', ' одна', ' дві']
        ];
        return e[3][k[0]] + (k[1] == 1 ? e[1][k[2]] : e[2][k[1]] + (d ? e[4][k[2]] : e[0][k[2]]));
    }

    return i;
}

function declOfNum(n, t, o) {
    let k = [2, 0, 1, 1, 1, 2, 2, 2, 2, 2];
    return (t == '' ? '' : ' ' + t + (n[n.length - 2] == "1" ? o[2] : o[k[n[n.length - 1]]]));
}

function razUp(e) {
    return e[1].toUpperCase() + e.substring(2);
}

function rozrahsumi(summ) {
    let a, val;
    a = Number(summ).toFixed(2).split('.');
    val = razUp(num_letters(a[0]) + declOfNum(a[0], 'грив', ['ня', 'ні', 'ень']) + ' ' + a[1] + declOfNum(a[1], 'копі', ['йка', 'йки', 'йок']));

    val = val.replace("Один гривня", "Одна гривня");
    val = val.replace("Два гривні", "Дві гривні");
    val = val.replace('один гривня', 'одна гривня');
    val = val.replace("два гривні", "дві гривні");

    return val;
}


function main(val) {
    rozrahsumi(val);
}

console.log(main('8750'));

